CustomerInterface/soap-sample.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lr="https://loungeroyale.local/customer">
    <soap:Body>
        <lr:CreateAppointment>
            <lr:appointment id="sample-booking-id">
                <lr:customerEmail>customer@example.com</lr:customerEmail>
                <lr:customerName>Sample Customer</lr:customerName>
                <lr:category>Hand Services</lr:category>
                <lr:service>Gel Manicure</lr:service>
                <lr:date>2026-06-18</lr:date>
                <lr:time>14:00</lr:time>
                <lr:notes>Preferred color: nude gold.</lr:notes>
            </lr:appointment>
        </lr:CreateAppointment>
    </soap:Body>
</soap:Envelope>
